tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
brew "webp"
brew "arping"
brew "bat"
brew "brew-php-switcher"
brew "btop"
brew "php"
brew "composer"
brew "ctop"
brew "duf"
brew "exa"
brew "fd"
brew "glances"
brew "htop"
brew "httpie"
brew "jid"
brew "mas"
brew "mtr"
brew "ncdu"
brew "nmap", link: false
brew "node"
brew "php@8.1"
brew "php@8.2"
brew "pipx"
brew "pngpaste"
brew "python@3.12"
brew "trash", link: true
brew "watch"
brew "yt-dlp"
brew "shivammathur/php/php@7.4"
cask "dbeaver-community"
cask "handbrake"
cask "icanhazshortcut"
cask "libreoffice"
cask "mysqlworkbench"
cask "ngrok"
cask "powershell"
cask "raycast"
cask "spotify"
mas "1Focus", id: 969210610
mas "AnkiApp", id: 689185915
mas "Magnet", id: 441258766
mas "Rocket.Chat", id: 1086818840
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "Unsplash Wallpapers", id: 1284863847
mas "Windows App", id: 1295203466
mas "WhatsApp", id: 1147396723
