tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Switch Apache / Valet / CLI configs between PHP versions
brew "brew-php-switcher"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Image format providing lossless and lossy compression for web images
brew "webp"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Top-like interface for container metrics
brew "ctop"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Alternative to top/htop
brew "glances"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Json incremental digger
brew "jid"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Turn any webpage into a desktop app with Rust with ease
brew "pake"
# General-purpose scripting language
brew "php@8.2"
# General-purpose scripting language
brew "php@8.4"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# CLI tool that moves files or folder to the trash
brew "trash"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
brew "shivammathur/php/php@7.4"
# Application uninstaller
cask "appcleaner"
cask "iterm2"
cask "dbeaver-community"
cask "handbrake"
cask "libreoffice"
cask "logi-options+"
cask "monitorcontrol"
cask "mysqlworkbench"
cask "ngrok"
cask "powershell"
cask "raycast"
cask "spotify"
# Remote access and connectivity software focused on security
cask "teamviewer"
mas "1Focus", id: 969210610
mas "AlgoApp", id: 689185915
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Rocket.Chat", id: 1086818840
mas "Telephone", id: 406825478
mas "Termix", id: 6752672071
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "Unsplash Wallpapers", id: 1284863847
mas "Windows App", id: 1295203466
mas "WhatsApp", id: 310633997