tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "homebrew/cask-drivers"
brew "arping"
brew "bat"
brew "btop"
brew "curl"
brew "php"
brew "composer"
brew "duf"
brew "exa"
brew "fd"
brew "glances"
brew "htop"
brew "mas"
brew "mtr"
brew "nmap"
brew "python@3.10"
brew "watch"
brew "watchman"
brew "wget"
brew "yt-dlp"
brew "node"
cask "iterm2"
cask "dbeaver-community"
cask "raycast"
cask "mysqlworkbench"
cask "postman"
cask "beekeeper-studio"
cask "appcleaner"
cask "logi-options-plus"
cask "visual-studio-code"
cask "handbrake"
cask "docker"
mas "1Focus", id: 969210610
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Rocket.Chat", id: 1086818840
mas "The Unarchiver", id: 425424353
mas "TickTick", id: 966085870
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723